// условный цикл while
let n = 0;

while (n < 5) {  // пока n меньше 5, повторять
    console.log(n);  // вывести n
    n++;  // увеличить на единичку
}
/*
++ <- оператор "инкремент" - последовательное
увеличение переменной на 1 и сохранение
получившегося значения в этой же переменной.

x = 1;
x++ (x = 1 + 1 = 2)
x++ (x = 2 + 1 = 3)
x++ (x = 3 + 1 = 4)

-- <- оператор "декремент" - последовательное
уменьшение переменной на 1 и сохранение
получившегося значения в этой же переменной.

x = 1;
x-- (x = 1 - 1 = 0)
x-- (x = 0 - 1 = -1)
x-- (x = -1 - 1 = -2)
*/

